Revit 2017 API
Plane Constructor
Overload List
Name | Description
Plane() |  Obsolete.
 Default constructor
Plane(XYZ, XYZ) |  Obsolete.
 Constructs a Plane object from a normal and an origin represented as XYZ objects. Follows the standard conventions for a planar surface. The constructed Plane object will pass through origin and be perpendicular to normal. The X and Y axes of the plane will be defined arbitrarily.
Plane(XYZ, XYZ, XYZ) |  Obsolete.
 Constructs a Plane object from X and Y axes and an origin represented as XYZ objects. The plane passes through "origin" and is spanned by the basis vectors "xVec" and "yVec".
See Also
Plane Class
Plane Members
Autodesk.Revit.DB Namespace